---
kind: other
id: Methods.T:Autodesk.Revit.DB.ParameterValueProvider
source: html/4002b7ce-ce2e-a02a-a33f-060257b07039.htm
---
# ParameterValueProvider Methods

Gets a global parameter value associated with a parameter from the given element.